src/InformationRegisters/дкл_НоменклатураСкладов/дкл_НоменклатураСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>дкл_НоменклатураСкладов</name>
  <resources>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.дкл_Статусы</types>
    </type>
  </resources>
  <resources>
    <name>СопоставленоВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>itemId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>extraCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>itemName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vendorNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>height</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>width</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>depth</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>weight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НастройкаСклада</name>
    <type>
      <types>CatalogRef.дкл_НастройкиСкладовЛифтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/дкл_НоменклатураСкладов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс   

//@skip-check export-procedure-missing-comment
//@skip-check doc-comment-parameter-section
//@skip-check doc-comment-export-function-return-section
Функция ПолучитьТекстЗапросаНоменклатурыСклада(ПоместитьВоВременнуюТаблицу = Ложь) Экспорт
	
	Текст =
	"ВЫБРАТЬ
	|	НоменклатураСклада.Номенклатура КАК Номенклатура,
	|	НоменклатураСклада.Характеристика КАК Характеристика,
	|	НоменклатураСклада.Упаковка КАК Упаковка,              
	// наименование собираем как Н + Х + У:
	|	ВЫБОР
	|		КОГДА НЕ НоменклатураСклада.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				И НЕ НоменклатураСклада.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА НоменклатураСклада.Номенклатура.Наименование + "", "" + НоменклатураСклада.Характеристика.Наименование + "", "" + НоменклатураСклада.Упаковка.Наименование
	|		КОГДА НЕ НоменклатураСклада.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				И НоменклатураСклада.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА НоменклатураСклада.Номенклатура.Наименование + "", "" + НоменклатураСклада.Характеристика.Наименование
	|		КОГДА НоменклатураСклада.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				И НЕ НоменклатураСклада.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	|			ТОГДА НоменклатураСклада.Номенклатура.Наименование + "", , "" + НоменклатураСклада.Упаковка.Наименование
	|		ИНАЧЕ НоменклатураСклада.Номенклатура.Наименование
	|	КОНЕЦ КАК itemName,
	|	НоменклатураСклада.extraCode КАК extraCode,
	|	НоменклатураСклада.itemId КАК itemId,
	|	НоменклатураСклада.unit КАК unit,
	|	НоменклатураСклада.vendorNumber КАК vendorNumber,
	|	НоменклатураСклада.height КАК height,
	|	НоменклатураСклада.width КАК width,
	|	НоменклатураСклада.depth КАК depth,
	|	НоменклатураСклада.weight КАК weight,
	|	НоменклатураСклада.barcode КАК barcode,
	|	НоменклатураСклада.Активна КАК Активна,
	|	НоменклатураСклада.СопоставленоВручную КАК СопоставленоВручную
	|ИЗ
	|	РегистрСведений.дкл_НоменклатураСкладов КАК НоменклатураСклада
	|ГДЕ
	|	НоменклатураСклада.НастройкаСклада = &НастройкаСклада";                                                       
	
	Если ПоместитьВоВременнуюТаблицу Тогда
		Текст = СтрЗаменить(Текст, "ИЗ", "ПОМЕСТИТЬ врНоменклатураСклада" + Символы.ПС + "ИЗ");		
		Текст = Текст + Символы.ПС + "ИНДЕКСИРОВАТЬ ПО	НоменклатураСклада.Номенклатура, НоменклатураСклада.Характеристика";
	КонецЕсли;

	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
